ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    cat = Cat.new(cats_params)

    redirect_to (cat.save ? cats_url : new_cat_url)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Christine"], ["updated_at", "2018-11-14 01:23:29.806021"], ["id", 2]]
---
  def update
    cat = Cat.find(params[:id])
    redirect_to (cat.update(cats_params) ? cat_url(cat) : edit_cat_url(cat))